app/views/events/show.html.erb

Performances:
<% @event.performances.each do |performance| %>
---
SELECT "performances".* FROM "performances" WHERE "performances"."event_id" = $1  [["event_id", 2]]