app/controllers/events_controller.rb

def index
  @performances = Performance.joins(:event).where(:events => {:approved => true})
  @date = params[:month] ? Date.parse(params[:month]) : Date.today
  @todays_performances= @performances.where(date: @date)
---
SELECT "performances".* FROM "performances" INNER JOIN "events" ON "events"."id" = "performances"."event_id" WHERE "events"."approved?" = $1  [["approved?", "t"]]
SELECT "performances".* FROM "performances" INNER JOIN "events" ON "events"."id" = "performances"."event_id" WHERE "events"."approved" = $1 AND "performances"."date" = $2  [["approved", "t"], ["date", "2016-08-03"]]

def show
  @event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]

def create
  @event = Event.new(event_params)
  binding.pry
  if @event.save
---
INSERT INTO "events" ("title", "writers", "venue", "performers", "description", "price_range", "ticket_link", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "video_link", "approved", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

def update
   @event = Event.find(params[:id])
   if @event.update_attributes(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "events" SET "title" = $1, "performers" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["title", "STUFF"], ["performers", "Charlie Cohen"], ["updated_at", "2016-07-31 21:13:35.808248"], ["id", 3]]

def destroy
  Event.find(params[:id]).destroy
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]