app/controllers/events_controller.rb

SELECT "performances".* FROM "performances" WHERE "performances"."approved?" = 't'
---
def index
  @performances = Performance.all

INSERT INTO "performances" ("date", "start_time", "end_time", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "0003-04-05"], ["start_time", "2:00"], ["end_time", "4:00"], ["event_id", 20], ["created_at", "2016-07-29 20:10:29.277248"], ["updated_at", "2016-07-29 20:10:29.277248"]]
---
def create
  @event = Event.new(event_params)
  binding.pry
   if @event.save
      performances.each do |performance|
        @event.performances << Performance.create(performance_params)