app/controllers/favorites_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "favorites" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 1], ["created_at", "2016-08-03 19:12:53.407151"], ["updated_at", "2016-08-03 19:12:53.407151"]]
---
def create
  @event = Event.find_by(id: params[:event])
  @favorite = Favorite.create( user_id: current_user.id, event_id: params[ :event ] )

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."event_id" = $2 LIMIT 1  [["user_id", 1], ["event_id", 2]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 3]]
---
def destroy
  @event = Event.find_by(id: params[:event_id])
  @favorite = Favorite.find_by(user_id:current_user.id, event_id: @event.id)
  @favorite.destroy