app/controllers/pages_controller.rb

def admin
@events = Event.where(approved?: false)
---
SELECT "events".* FROM "events" WHERE "events"."approved?" = $1  [["approved?", "f"]]