app/controllers/performances_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 7]]
SELECT "performances".* FROM "performances" WHERE "performances"."event_id" = $1  [["event_id", 7]]
---
def new
@event = Event.find_by( id: params[ :event_id ] )
@performance = Performance.new
  if @event.performances.length >= 1

INSERT INTO "performances" ("event_id", "date", "start_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["event_id", 7], ["date", "2016-08-06"], ["start_time", "{1=>1, 2=>1, 3=>1, 4=>13, 5=>15}"], ["created_at", "2016-08-01 19:58:16.852032"], ["updated_at", "2016-08-01 19:58:16.852032"]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 7]]
---
  def create
    @performance = Performance.create( performance_params )
    @event = Event.find_by( id: params[ :event_id ])